Project/Toir/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/торо_СписокОбъектовРегламентногоМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СписокОбъектовРегламентногоМероприятия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИндивидуальноеОбслуживаниеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_МаршрутыРегламентныхМероприятий/торо_МаршрутыРегламентныхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МаршрутыРегламентныхМероприятий</name>
  <resources>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Список объектов регламентного мероприятия
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.торо_СписокОбъектовРегламентногоМероприятия";
	КомандаПечати.Идентификатор = "СписокОбъектовРМ";
	КомандаПечати.Представление = НСтр("es='La lista de los objetos';ru='Список объектов';en='List of objects'");
	//КомандаПечати.Обработчик = "торо_Печать.ЗапроситьДопПараметрыПечатиОР";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписокОбъектовРМ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"СписокОбъектовРМ", 
		"Список объектов регламентного мероприятия", 
		ПечатьСпискаОбъектовРМ(МассивОбъектов, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьСпискаОбъектовРМ(МассивОбъектов, ПараметрыПечати) 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПФ_MXL_СписокОбъектовРМ");
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ЭтоПервый = Истина;
	
	Для каждого Объект Из МассивОбъектов Цикл
		
		Если Объект.ЭтоГруппа = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоПервый Тогда
			ТабДок.Вывести(ОбластьОтступ);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ОбластьШапки         = Макет.ПолучитьОбласть("ШапкаСписка");
		ОбластьШапкиТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрокиТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьГраницы       = Макет.ПолучитьОбласть("ГраницаТаблицы");
		
		
		ОбластьШапки.Параметры.СписокОбъектовРМ = Объект.Наименование;
		ТабДок.Вывести(ОбластьШапки);
		ТабДок.Вывести(ОбластьШапкиТаблицы);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_МаршрутыРегламентныхМероприятий.НомерПоПорядку КАК Номер,
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.Код КАК Код,
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.АдресМестонахождения КАК Местонахождение,
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ИнвентарныйНомер КАК ИнвНомер,
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ЗаводскойНомер КАК ЗавНомер,
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта.ТехНомер КАК ТехНомер
		|ИЗ
		|	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		|ГДЕ
		|	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
		Запрос.УстановитьПараметр("Ссылка", Объект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ОбластьСтрокиТаблицы.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьСтрокиТаблицы);
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьГраницы);
	КонецЦикла;

	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
